VioletLavender/MM32/OTA/zhu/MM32W0xxn_OTA_APP/Device/MM32L0xx/Include/MM32L073PF11111.h
    __IO uint32_t  rEP0_AVIL;		 	/*!           Address offset: 0x100 */
    __IO uint32_t  rEP1_AVIL;			/*!           Address offset: 0x104 */
    __IO uint32_t  rEP2_AVIL;			/*!           Address offset: 0x108 */
    __IO uint32_t  rEP3_AVIL;			/*!           Address offset: 0x10C */
    __IO uint32_t  rEP4_AVIL;			/*!           Address offset: 0x110 */

    __IO uint32_t  RESERVED36; 			/*!           Address offset: 0x114 */
    __IO uint32_t  RESERVED37; 			/*!           Address offset: 0x118 */
    __IO uint32_t  RESERVED38; 			/*!           Address offset: 0x11C */
    __IO uint32_t  RESERVED39; 			/*!           Address offset: 0x120 */

    __IO uint32_t  RESERVED40; 			/*!           Address offset: 0x124 */
    __IO uint32_t  RESERVED41; 			/*!           Address offset: 0x128 */
    __IO uint32_t  RESERVED42; 			/*!           Address offset: 0x12C */
    __IO uint32_t  RESERVED43; 			/*!           Address offset: 0x130 */

    __IO uint32_t  RESERVED44; 			/*!           Address offset: 0x134 */
    __IO uint32_t  RESERVED45; 			/*!           Address offset: 0x138 */
    __IO uint32_t  RESERVED46; 			/*!           Address offset: 0x13C */

    __IO uint32_t  rEP0_CTRL;			/*!           Address offset: 0x140 */
    __IO uint32_t  rEP1_CTRL;			/*!           Address offset: 0x144 */
    __IO uint32_t  rEP2_CTRL;			/*!           Address offset: 0x148 */
    __IO uint32_t  rEP3_CTRL;			/*!           Address offset: 0x14C */
    __IO uint32_t  rEP4_CTRL;			/*!           Address offset: 0x150 */

    __IO uint32_t  RESERVED47; 			/*!           Address offset: 0x154 */
    __IO uint32_t  RESERVED48; 			/*!           Address offset: 0x158 */
    __IO uint32_t  RESERVED49; 			/*!           Address offset: 0x15C */
    //__IO uint32_t  RESERVED50; 			/*!           Address offset: 0x15C */

    //__IO uint32_t  rEPn_FIFO[5];			/*!           Address offset: 0x160 */

    __IO uint32_t  rEP0_FIFO;			/*!           Address offset: 0x160 */
    __IO uint32_t  rEP1_FIFO;			/*!           Address offset: 0x164 */
    __IO uint32_t  rEP2_FIFO;			/*!           Address offset: 0x168 */
    __IO uint32_t  rEP3_FIFO;			/*!           Address offset: 0x16C */
    __IO uint32_t  rEP4_FIFO;			/*!           Address offset: 0x170 */

    __IO uint32_t  RESERVED51; 			/*!           Address offset: 0x174 */
    __IO uint32_t  RESERVED52; 			/*!           Address offset: 0x178 */
    __IO uint32_t  RESERVED53; 			/*!           Address offset: 0x17C */

    __IO uint32_t  RESERVED54; 			/*!           Address offset: 0x180 */

    __IO uint32_t  rEP_DMA;				/*!           Address offset: 0x184 */
    __IO uint32_t  rEP_HALT;			/*!           Address offset: 0x188 */
    __IO uint32_t  RESERVED55; 			/*!           Address offset: 0x18C */

    __IO uint32_t  RESERVED56; 			/*!           Address offset: 0x190 */
    __IO uint32_t  RESERVED57; 			/*!           Address offset: 0x194 */
    __IO uint32_t  RESERVED58; 			/*!           Address offset: 0x198 */
    __IO uint32_t  RESERVED59; 			/*!           Address offset: 0x19C */

    __IO uint32_t  RESERVED60; 			/*!           Address offset: 0x1A0 */
    __IO uint32_t  RESERVED61; 			/*!           Address offset: 0x1A4 */
    __IO uint32_t  RESERVED62; 			/*!           Address offset: 0x1A8 */
    __IO uint32_t  RESERVED63; 			/*!           Address offset: 0x1AC */

    __IO uint32_t  RESERVED64; 			/*!           Address offset: 0x1B0 */
    __IO uint32_t  RESERVED65; 			/*!           Address offset: 0x1B4 */
    __IO uint32_t  RESERVED66; 			/*!           Address offset: 0x1B8 */
    __IO uint32_t  RESERVED67; 			/*!           Address offset: 0x1BC */
    __IO uint32_t  rPOWER;				/*!           Address offset: 0x1C0 */
} USB_TypeDef;

#endif

/**
* @}
*/

/** @addtogroup Peripheral_memory_map
* @{
*/

#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the alias region */
#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the alias region */

#define SRAM_BASE             ((uint32_t)0x20000000) /*!< Peripheral base address in the bit-band region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< SRAM base address in the bit-band region */

#define FSMC_R_BASE           ((uint32_t)0xA0000000) /*!< FSMC registers base address */



/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APBPERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)


#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)

#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)
#define UART2_BASE            (APB1PERIPH_BASE + 0x4400)

#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x6400)

#define BKP_BASE              (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)

#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400)

#define GPIOA_BASE            (0x48000000)
#define GPIOB_BASE            (0x48000400)
#define GPIOC_BASE            (0x48000800)
#define GPIOD_BASE            (0x48000C00)
#define AES_BASE              (0x40026000)
#define CRS_BASE              (0x40006C00)
#define USB_BASE          	  (0x40005C00)

#define COMP_BASE             (APB2PERIPH_BASE + 0x00003C00)
#define COMP1_BASE            (APB2PERIPH_BASE +  0x00003C00)
#define COMP2_BASE            (APB2PERIPH_BASE +  0x00003C04)

#define ADC1_BASE             (APB2PERIPH_BASE + 0x2400)

#define TIM1_BASE             (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000)

#define UART1_BASE            (APB2PERIPH_BASE + 0x3800)
#define TIM14_BASE            (APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE            (APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE            (APB2PERIPH_BASE + 0x4800)

#define DMA1_BASE             (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE    (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE    (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE    (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE    (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE    (AHBPERIPH_BASE + 0x0058)

#define RCC_BASE              (AHBPERIPH_BASE + 0x1000)


#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x2000) /*!< Flash registers base address */
#define OB_BASE               ((uint32_t)0x1FFFF800)    /*!< Flash Option Bytes base address */

